fonecmid-diplom/src/DataProcessors/ВКМ_ЗаполнениеГрафика/ВКМ_ЗаполнениеГрафика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_ЗаполнениеГрафика</name>
</mdclass:DataProcessor>

fonecmid-diplom/src/InformationRegisters/ВКМ_ГрафикРаботы/ВКМ_ГрафикРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикРаботы</name>
  <resources>
    <name>ВКМ_Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/DataProcessors/ВКМ_ЗаполнениеГрафика/ObjectModule.bsl
Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни) Экспорт
	
	Набор = РегистрыСведений.ВКМ_ГрафикРаботы.СоздатьНаборЗаписей(); 
	
	Набор.Прочитать();
	
	ЧислоСекундВСутках = 86400;
	
	Дат = ДатаНачала;
	
	Для к = 0 По Набор.Количество()-1 Цикл
		
		Запись = Набор[к];
		
		Если Запись.ВКМ_Дата < ДатаНачала Тогда
			
		    Продолжить;
		    
		ИначеЕсли Запись.ВКМ_Дата =Дат Тогда 
			
			Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
				
				Запись.ВКМ_Значение = 0;
				
			Иначе
					          
				Запись.ВКМ_Значение = 1;
				
			КонецЕсли;
			
			Дат = Дат + ЧислоСекундВСутках;
		Иначе
			Пока Дат < Мин(Запись.ВКМ_Дата, ДатаОкончания) Цикл
				
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.ВКМ_Дата = Дат;

				Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
					
					НоваяЗапись.ВКМ_Значение = 0;
				Иначе
						          
					
					НоваяЗапись.ВКМ_Значение = 1;
					
				КонецЕсли; 
				
				Дат = Дат + ЧислоСекундВСутках;
				
			КонецЦикла;
			 
			Если Запись.ВКМ_Дата > ДатаОкончания Тогда
				
				Прервать;
				
			Иначе 
				
				Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
					
					Запись.ВКМ_Значение = 0;
				Иначе
						          
					
					Запись.ВКМ_Значение = 1;
				КонецЕсли;
				
			КонецЕсли;
			
			Дат = Дат + ЧислоСекундВСутках;
		
		КонецЕсли; 
	
	КонецЦикла;
	
	Набор.Записать();
	
	Пока Дат <= ДатаОкончания Цикл
		
		Запись = Набор.Добавить();
		Запись.ВКМ_Дата = Дат; 
		
		Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
			
			Запись.ВКМ_Значение = 0;
		
		Иначе	          
			
			Запись.ВКМ_Значение = 1;
		
		КонецЕсли; 
		
		Дат = Дат + ЧислоСекундВСутках;
	
	КонецЦикла; 
	
	Набор.Записать();
				
КонецПроцедуры
